Table of Contents
 Class MatReinforcement
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Material reinforcement base class
public abstract class MatReinforcement : Material
Inheritance
object
OpenObject
OpenElementId
Material
MatReinforcement
Derived
MatReinforcementACI
MatReinforcementAUS
MatReinforcementCAN
MatReinforcementCHN
MatReinforcementEc2
MatReinforcementHKG
MatReinforcementIND
MatReinforcementRUS
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 BarSurface
Surface of bar
public ReinfBarSurface BarSurface { get; set; }
Property Value
ReinfBarSurface
 Edit this page